### Find whose salary is same in same department

In [1]:
import numpy as np
import pandas as pd

In [2]:
emp_salary = pd.read_csv('./data/emp_salary.csv')

In [7]:
emp_salary.sort_values(['dept_id','salary'])

   emp_id    name  salary  dept_id
0     101   sohan    3000       11
3     104     cat    3000       11
6     108   kamal    8000       11
1     102   rohan    4000       12
4     105  suresh    4000       12
5     109  mahesh    7000       12
2     103   mohan    5000       13

In [19]:
close = emp_salary.groupby(['dept_id','salary']).count().reset_index()
close = close.loc[close['emp_id']>1,['dept_id','salary']]
close

   dept_id  salary
0       11    3000
2       12    4000

In [27]:
merged_data = pd.merge(emp_salary,close, on='dept_id').merge(close,left_on='salary_x',right_on='salary').rename(columns={'dept_id_x':'dept_id'})
merged_data

   emp_id    name  salary_x  dept_id  salary_y  dept_id_y  salary
0     101   sohan      3000       11      3000         11    3000
1     104     cat      3000       11      3000         11    3000
2     102   rohan      4000       12      4000         12    4000
3     105  suresh      4000       12      4000         12    4000

In [28]:
merged_data[['emp_id','name','salary','dept_id']]

   emp_id    name  salary  dept_id
0     101   sohan    3000       11
1     104     cat    3000       11
2     102   rohan    4000       12
3     105  suresh    4000       12